denuncia-anonima/app/Http/Controllers/ReportController.php

insert into `usuarios` (`login`, `password`, `id_perfil`, `updated_at`, `created_at`) values ('v9wAg66p', '$2y$12$0Edt11/pAww2w3TNMGQBfeJ.m0jEF4zWJRfaYEfRaDd6tYdHgdbDa', 2, '2024-11-19 23:44:04', '2024-11-19 23:44:04')
---
    public function store(Request $request)
    {
        $credentials = null;

        $messages = [
            'arquivos.*.max' => 'Os arquivos não podem ter mais que 2MB.',
            'arquivos.*.mimes' => 'Os arquivos devem ser um dos seguintes tipos: jpg, jpeg, png, pdf, doc, docx, xls, xlsx, csv, zip, rar.'
        ];

        $request->validate([
            'arquivos.*' => 'nullable|file|mimes:jpg,jpeg,png,pdf,doc,docx,xls,xlsx,csv,zip,rar|max:2048',
        ], $messages);

        if (!Auth::check()) {
            $credentials = $this->generate_random_credentials();

            $usuario = new Usuario();
            $usuario->login = $credentials['login'];
            $usuario->password = bcrypt($credentials['password']);
            $perfil = Perfil::where('nome', 'denunciante')->first();

            if ($perfil) {
                $usuario->id_perfil = $perfil->id;
            } else {
                throw new Exception('Perfil "denunciante" não encontrado.');
            }

            $usuario->save();

insert into `denuncias` (`protocolo`, `descricao`, `titulo`, `pessoas_afetadas`, `data_ocorrido`, `id_usuario`, `updated_at`, `created_at`) values ('8aa6Kv', 'return redirect()->route(\'confirmacao\', [\'token\' => $token])->with(\'success\', \'Denúncia criada com sucesso!\');\r\n            return redirect()->route(\'confirmacao\', [\'token\' => $token])->with(\'success\', \'Denúncia criada com sucesso!\');\r\n            return redirect()->route(\'confirmacao\', [\'token\' => $token])->with(\'success\', \'Denúncia criada com sucesso!\');', 'confirmacao', 'Alunos', '2024-11-14', 5, '2024-11-19 23:44:04', '2024-11-19 23:44:04')
---

        $denuncia->id_usuario = Auth::id();

        $denuncia->save();