denuncia-anonima/app/Http/Controllers/ShowController.php

select * from `denuncias` where `denuncias`.`id` = '2' limit 1
select `tipos_denuncia`.*, `denuncia_tipo_denuncia`.`denuncia_id` as `pivot_denuncia_id`, `denuncia_tipo_denuncia`.`tipo_denuncia_id` as `pivot_tipo_denuncia_id`, `denuncia_tipo_denuncia`.`created_at` as `pivot_created_at`, `denuncia_tipo_denuncia`.`updated_at` as `pivot_updated_at` from `tipos_denuncia` inner join `denuncia_tipo_denuncia` on `tipos_denuncia`.`id` = `denuncia_tipo_denuncia`.`tipo_denuncia_id` where `denuncia_tipo_denuncia`.`denuncia_id` in (2)
---
    public function show($id)
    {
        // Recupere a denúncia específica pelo id, incluindo os tipos de denúncia
        $denuncia = Denuncia::with('tiposDenuncia')->find($id);