denuncia-anonima/app/Http/Controllers/ShowReportsController.php

select * from `denuncias` where `id_usuario` = 3
---
    public function index(Request $request)
    {
        $user = Auth::user();
        $userRole = $user->perfil->nome;

        $filter = $request->input('filter', 'todas');

        switch ($userRole) {
            case 'admin':
                $query = Denuncia::query();
                break;
            case 'analista':
                $query = Denuncia::where('id_responsavel', $user->id);
                break;
            case 'denunciante':
                $query = Denuncia::where('id_usuario', $user->id);
                break;
            default:
                return redirect()->route('home')->with('error', 'Perfil não reconhecido.');
        }

        if ($filter === 'pendentes') {
            $query->whereNull('id_responsavel');
        } elseif ($filter === 'andamento') {
            $query->whereNull('data_conclusao')->whereNotNull('id_responsavel');
        } elseif ($filter === 'concluidas') {
            $query->whereNotNull('data_conclusao');
        }

        $userReports = $query->get();